OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1618.h
extern __at(0x0896) __sfr AT1CSEL3;

typedef union
  {
  struct
    {
    unsigned AT1CP3S0           : 1;
    unsigned AT1CP3S1           : 1;
    unsigned AT1CP3S2           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CP3S0              : 1;
    unsigned CP3S1              : 1;
    unsigned CP3S2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CP3S               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned AT1CP3S            : 3;
    unsigned                    : 5;
    };
  } __AT1CSEL3bits_t;

extern __at(0x0896) volatile __AT1CSEL3bits_t AT1CSEL3bits;

#define _AT1CP3S0               0x01
#define _CP3S0                  0x01
#define _AT1CP3S1               0x02
#define _CP3S1                  0x02
#define _AT1CP3S2               0x04
#define _CP3S2                  0x04

//==============================================================================

extern __at(0x0897) __sfr AT1CC3;

//==============================================================================
//        AT1CC3L Bits

extern __at(0x0897) __sfr AT1CC3L;

typedef union
  {
  struct
    {
    unsigned AT1CC30            : 1;
    unsigned AT1CC31            : 1;
    unsigned AT1CC32            : 1;
    unsigned AT1CC33            : 1;
    unsigned AT1CC34            : 1;
    unsigned AT1CC35            : 1;
    unsigned AT1CC36            : 1;
    unsigned AT1CC37            : 1;
    };

  struct
    {
    unsigned CC30               : 1;
    unsigned CC31               : 1;
    unsigned CC32               : 1;
    unsigned CC33               : 1;
    unsigned CC34               : 1;
    unsigned CC35               : 1;
    unsigned CC36               : 1;
    unsigned CC37               : 1;
    };
  } __AT1CC3Lbits_t;

extern __at(0x0897) volatile __AT1CC3Lbits_t AT1CC3Lbits;

#define _AT1CC30                0x01
#define _CC30                   0x01
#define _AT1CC31                0x02
#define _CC31                   0x02
#define _AT1CC32                0x04
#define _CC32                   0x04
#define _AT1CC33                0x08
#define _CC33                   0x08
#define _AT1CC34                0x10
#define _CC34                   0x10
#define _AT1CC35                0x20
#define _CC35                   0x20
#define _AT1CC36                0x40
#define _CC36                   0x40
#define _AT1CC37                0x80
#define _CC37                   0x80

//==============================================================================


//==============================================================================
//        AT1CC3H Bits

extern __at(0x0898) __sfr AT1CC3H;

typedef union
  {
  struct
    {
    unsigned AT1CC38            : 1;
    unsigned AT1CC39            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CC38               : 1;
    unsigned CC39               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __AT1CC3Hbits_t;

extern __at(0x0898) volatile __AT1CC3Hbits_t AT1CC3Hbits;

#define _AT1CC38                0x01
#define _CC38                   0x01
#define _AT1CC39                0x02
#define _CC39                   0x02

//==============================================================================


//==============================================================================
//        AT1CCON3 Bits

extern __at(0x0899) __sfr AT1CCON3;

typedef union
  {
  struct
    {
    unsigned AT1CC3MODE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AT1CAP3P           : 1;
    unsigned AT1CC3POL          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AT1CC3EN           : 1;
    };

  struct
    {
    unsigned CC3MODE            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CAP3P              : 1;
    unsigned CC3POL             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CC3EN              : 1;
    };
  } __AT1CCON3bits_t;

extern __at(0x0899) volatile __AT1CCON3bits_t AT1CCON3bits;

#define _AT1CC3MODE             0x01
#define _CC3MODE                0x01
#define _AT1CAP3P               0x08
#define _CAP3P                  0x08
#define _AT1CC3POL              0x10
#define _CC3POL                 0x10
#define _AT1CC3EN               0x80
#define _CC3EN                  0x80

//==============================================================================

extern __at(0x0D8C) __sfr SMT1TMR;

//==============================================================================
//        SMT1TMRL Bits

extern __at(0x0D8C) __sfr SMT1TMRL;

typedef struct
  {
  unsigned SMT1TMR0             : 1;
  unsigned SMT1TMR1             : 1;
  unsigned SMT1TMR2             : 1;
  unsigned SMT1TMR3             : 1;
  unsigned SMT1TMR4             : 1;
  unsigned SMT1TMR5             : 1;
  unsigned SMT1TMR6             : 1;
  unsigned SMT1TMR7             : 1;
  } __SMT1TMRLbits_t;

extern __at(0x0D8C) volatile __SMT1TMRLbits_t SMT1TMRLbits;

#define _SMT1TMR0               0x01
#define _SMT1TMR1               0x02
#define _SMT1TMR2               0x04
#define _SMT1TMR3               0x08
#define _SMT1TMR4               0x10
#define _SMT1TMR5               0x20
#define _SMT1TMR6               0x40
#define _SMT1TMR7               0x80

//==============================================================================


//==============================================================================
//        SMT1TMRH Bits

extern __at(0x0D8D) __sfr SMT1TMRH;

typedef struct
  {
  unsigned SMT1TMR8             : 1;
  unsigned SMT1TMR9             : 1;
  unsigned SMT1TMR10            : 1;
  unsigned SMT1TMR11            : 1;
  unsigned SMT1TMR12            : 1;
  unsigned SMT1TMR13            : 1;
  unsigned SMT1TMR14            : 1;
  unsigned SMT1TMR15            : 1;
  } __SMT1TMRHbits_t;

